# -*- mode:org; -*-

#+title:Learning ReactJS17
#+subtitle:{{{version}}} {{{date}}}
#+author:LOLH
#+date:2020-12-22 22:53
#+macro:version Version 0.0.10
#+macro:upload-date (eval (current-time-string))
#+bucket:pinecone-forest.com

{{{version}}} {{{date}}}

#+texinfo:@insertcopying


** Ignore
  #+name:update-org-project
  #+begin_src emacs-lisp
    (defun get-parsed-tree (buf)
      "Given a buffer BUF, return a parsed tree."
      (with-current-buffer buf
	(org-element-parse-buffer 'headline)))

    (defun oep (p e)
      "Given a property P and element E, return that property's value."
      (org-element-property p e))

    (defun start-end (buf prop)
      "Given a buffer BUF and a property PROP, return the starting and ending points."
      (org-element-map
	  (get-parsed-tree buf)
	  'headline
	  (lambda (e) (when (string= (oep :CUSTOM_ID e) prop)
			(list
			 (oep :begin e)
			 (oep :end e))))
	  nil t))

    (defun update-old-project (&optional title author bucket)
      "Update an old project with new code."
      (with-current-buffer (car (find-file-noselect "./*.org" nil nil t))
	(save-excursion
	(goto-char (point-min))
	;; (when title
	;;   (re-search-forward "^#[+]title:\s*\\(.*\\)$")
	;;   (replace-match title t nil nil 1))
	;; (when author
	;;   (re-search-forward "^#[+]author:\s*\\(.*\\)$")
	;;   (replace-match author t nil nil 1))
	;; (when bucket
	;;   (re-search-forward "^#[+]bucket:\s*\\(.*\\)$")
	;;   (replace-match bucket t nil nil 1))
	(let* ((curbuf (current-buffer))
	      (orgsyncbuf (find-file-noselect (expand-file-name "Template.org" "/usr/local/dev/Templates/Org")))
	      (start-end-curbuf (start-end curbuf "build-tools"))
	      (start-end-sync (start-end orgsyncbuf "build-tools")))
	  (list start-end-curbuf start-end-sync)))))
  #+end_src

  #+begin_src emacs-lisp :results raw
  (update-old-project)
  #+end_src

  #+RESULTS:
  ((4928 36833) (4928 36833))

